[
  {
    "id": 1,
    "title": "Elegant private villa in Ethiopia",
    "image": "/cases/1.jpeg",
    "location": "Ethiopia",
    "project_type": "Private villa in Magenagna B+G+2 1299 M²",
    "text01": "Supply items: Tiles ,sanitary,Door, Aluminum window, stairs, kitchen cabinet, wardrobes,lightings,wall panels .",
    "text02": "Completion date :2024",
    "text03": "In 2023, the customer invited our team for measurement and installation. With the cooperation of the owner and our professional guidance, our team of 7 people spent 20 days to complete the installation of the stairs, Windows and walls of the main building.  From the initial drawing confirmation to the final installation, the entire process took 4 months. This includes four weeks of design, 40 days of production and 35 days of shipping. still today installation and fixing. more projects are coming on process around sarbet ,bole bulbole,cmc , Gerji , goro and summit. The private villa project in Magenagna, Ethiopia, involves the construction of a 1299 square meter building spanning basement, ground, and two upper levels. The project is slated for completion by the end of this year. The supply items for this project include a variety of materials and fixtures essential for the construction and outfitting of the villa. This encompasses tiles for flooring and walls, sanitary ware for bathrooms, doors for access points, aluminum windows for natural light and ventilation, stairs for inter-level access, kitchen cabinets for storage and workspace, wardrobes for clothing storage, lighting fixtures for illumination, and wall panels for aesthetic purposes.",
    "text04": "Each of these items plays a crucial role in the functionality and aesthetics of the private villa. The tiles will not only provide durable flooring but also enhance the visual appeal of the interiors. The sanitary ware will ensure modern and efficient bathroom facilities. Doors and windows will offer security, privacy, and natural light. Stairs will facilitate movement between floors. Kitchen cabinets and wardrobes will provide storage solutions tailored to the occupants' needs. Lighting fixtures will create ambiance and illuminate the spaces effectively. Wall panels will add texture and interest to the walls, enhancing the overall design scheme. The completion of this private villa project will result in a luxurious and well-appointed residence in the upscale area of Magenagna. The attention to detail in the selection and supply of these essential items will ensure that the villa meets the highest standards of quality and comfort. The project team is dedicated to delivering a final product that exceeds expectations and provides a superior living environment for the residents.",
    "gallery": [
      "/cases/gallery/002.jpeg",
      "/cases/gallery/003.jpeg",
      "/cases/gallery/004.jpeg",
      "/cases/gallery/005.jpeg",
      "/cases/gallery/006.jpeg",
      "/cases/gallery/007.jpeg",
      "/cases/gallery/008.jpeg",
      "/cases/gallery/009.jpeg",
      "/cases/gallery/010.jpeg",
      "/cases/gallery/011.jpeg",
      "/cases/gallery/012.jpeg"
    ]
  },
  {
    "id": 2,
    "title": "Luxurious residential project in Nigeria with 1600 sqm of space",
    "image": "/cases/2.jpeg",
    "location": "Nigeria lagos",
    "project_type": "",
    "text01": "space: 1600 sqm",
    "text02": "interior design style : classic luxury",
    "text03": "delivery product: wooden flooring, marble, sanitary feature, lighting feature,cabinetry, windows,doors,staircase etcOur team of experienced interior designers in Lagos, Nigeria are ready to transform your 1600 sqm space into a classic luxury masterpiece. We will provide top-quality wooden flooring, exquisite marble finishes, elegant sanitary features, stunning lighting fixtures, custom cabinetry, beautiful windows and doors, and a grand staircase that will be the focal point of your home. Trust us to create a timeless and sophisticated interior design that will exceed your expectations. Contact us today to begin the journey to your dream home. Contact us today to begin the journey to your dream home.",
    "text04": "",
    "gallery": [
      "/cases/gallery/013.jpeg",
      "/cases/gallery/014.jpeg",
      "/cases/gallery/015.jpeg",
      "/cases/gallery/016.jpeg",
      "/cases/gallery/017.jpeg",
      "/cases/gallery/018.jpeg",
      "/cases/gallery/019.jpeg",
      "/cases/gallery/020.jpeg"
    ]
  },
  {
    "id": 3,
    "title": "Contemporary Riyadh Saudi Arabia Home Decor",
    "image": "/cases/3.jpeg",
    "location": "Saudi Arabia",
    "project_type": "",
    "text01": "For a modern luxury interior design style in a 1300 sqm space in Riyadh, Saudi Arabia, the key elements to focus on would be wooden flooring, marble accents, sanitary features, lighting fixtures, cabinetry, windows, doors, and staircase design.",
    "text02": "To achieve a cohesive and sophisticated look, the wooden flooring should be high-quality and durable, bringing warmth and elegance to the space. Marble can be used for countertops, accent walls, or even as flooring in certain areas to add a touch of luxury. When it comes to sanitary features, opt for sleek and modern designs for faucets, sinks, and showers. Consider incorporating high-tech features like smart toilets or shower systems for added convenience.",
    "text03": "Lighting features play a crucial role in setting the mood and ambiance of the space. Consider using a combination of recessed lighting, statement chandeliers, and wall sconces to create a layered lighting scheme that is both functional and stylish. Cabinetry should be minimalistic and streamlined, with plenty of storage space to keep the area clutter-free. Opt for high-quality materials and finishes to elevate the overall look of the space. Windows and doors should be chosen to complement the overall design aesthetic, whether that means sleek and modern or more traditional with a contemporary twist. Consider adding statement pieces like floor-to-ceiling windows or oversized doors to make a bold statement.",
    "text04": "Lastly, the staircase design should be both functional and visually appealing. Consider using materials like glass, metal, or wood to create a modern and luxurious staircase that becomes a focal point in the space. By paying attention to these key elements and incorporating them thoughtfully into the design, you can create a modern luxury interior that is both stylish and functional in your 1300 sqm space in Riyadh, Saudi Arabia.",
    "gallery": [
      "/cases/gallery/013.jpeg",
      "/cases/gallery/021.jpeg",
      "/cases/gallery/022.jpeg",
      "/cases/gallery/023.jpeg",
      "/cases/gallery/024.jpeg",
      "/cases/gallery/025.jpeg",
      "/cases/gallery/026.jpeg",
      "/cases/gallery/027.jpeg",
      "/cases/gallery/028.jpeg",
      "/cases/gallery/029.jpeg",
      "/cases/gallery/030.jpeg",
      "/cases/gallery/031.jpeg",
      "/cases/gallery/032.jpeg",
      "/cases/gallery/033.jpeg",
      "/cases/gallery/034.jpeg",
      "/cases/gallery/035.jpeg"
    ]
  },
  {
    "id": 4,
    "title": "Sleek and Contemporary Penthouse Design in the USA",
    "image": "/cases/4.jpeg",
    "location": "USA",
    "project_type": "",
    "text01": "When designing a minimalist and modern interior for a 1000 sqm space in the USA, it is important to focus on clean lines, simplicity, and functionality. Here are some key elements to consider when selecting delivery products for this project:",
    "text02": "Wooden Flooring: Opt for light-colored hardwood or engineered wood flooring to create a warm and inviting atmosphere. Consider wide planks or herringbone patterns for a more modern look. Marble: Use marble for countertops, backsplashes, and accent walls to add a touch of luxury to the space. Choose a sleek, polished finish for a contemporary feel. Sanitary Features: Select sleek and modern fixtures for the kitchen and bathrooms, such as minimalist faucets, sinks, and showers. Consider using white or neutral tones to maintain a clean and cohesive look. Lighting Features: Incorporate recessed lighting, pendant lights, and track lighting to illuminate the space and create a sense of openness. Opt for fixtures with clean lines and simple designs to complement the minimalist style.",
    "text03": "Cabinetry: Choose custom cabinetry with flat-panel doors, hidden hardware, and a matte finish to keep the space clutter-free and streamlined. Consider integrating smart storage solutions to maximize functionality. Windows and Doors: Select oversized windows and sliding glass doors to bring in natural light and connect the indoors with the outdoors. Opt for black metal frames for a modern touch that contrasts with the light wood and marble finishes.",
    "text04": "Staircase: Design a floating staircase with glass railings and metal or wood treads to create a striking focal point in the space. Keep the design simple and understated to maintain the minimalist aesthetic. By carefully selecting delivery products that adhere to the minimalist and modern interior design style, you can create a sophisticated and harmonious living space in the USA. Remember to prioritize simplicity, functionality, and clean lines to achieve a timeless and elegant look that will stand the test of time.",
    "gallery": [
      "/cases/gallery/013.jpeg",
      "/cases/gallery/036.jpeg",
      "/cases/gallery/037.jpeg",
      "/cases/gallery/038.jpeg",
      "/cases/gallery/039.jpeg",
      "/cases/gallery/040.jpeg",
      "/cases/gallery/041.jpeg",
      "/cases/gallery/042.jpeg",
      "/cases/gallery/043.jpeg",
      "/cases/gallery/044.jpeg",
      "/cases/gallery/045.jpeg",
      "/cases/gallery/046.jpeg",
      "/cases/gallery/047.jpeg",
      "/cases/gallery/048.jpeg"
    ]
  },
  {
    "id": 5,
    "title": "Spacious 988 sqm Modern Home in Dubai",
    "image": "/cases/5.jpeg",
    "location": "Global",
    "project_type": "",
    "text01": "Located in the bustling city of Dubai, this 998 sqm space is undergoing a modern interior design transformation. The goal is to create a sleek and sophisticated atmosphere that reflects the city's cosmopolitan vibe. The key elements that will be included in this project are wooden flooring, marble accents, sanitary features, lighting fixtures, cabinetry, windows, doors, staircase, wardrobe and more. Each element has been carefully selected to enhance the overall design and functionality of the space.",
    "text02": "The wooden flooring will add warmth and texture to the rooms, while the marble accents will bring a touch of luxury and elegance. The sanitary features will be sleek and modern, ensuring both style and functionality. Lighting fixtures will be strategically placed to create a bright and inviting ambiance. Cabinetry will be custom-designed to maximize storage space and keep the rooms clutter-free. Windows and doors will be chosen for their durability and energy efficiency. The staircase will be a focal point, with a modern design that complements the overall aesthetic of the space. Wardrobes will be designed with organizational features to keep clothing and accessories neatly stored.",
    "text03": "The interior design style will be clean and minimalist, with a focus on sleek lines and neutral colors. The overall look will be sophisticated and timeless, creating a space that is both stylish and functional.",
    "text04": "With attention to detail and careful selection of materials, this modern interior design project in Dubai is sure to impress. Stay tuned for updates as the space is transformed into a stunning showcase of contemporary design.",
    "gallery": [
      "/cases/gallery/013.jpeg",
      "/cases/gallery/049.jpeg",
      "/cases/gallery/050.jpeg",
      "/cases/gallery/051.jpeg",
      "/cases/gallery/052.jpeg",
      "/cases/gallery/053.jpeg",
      "/cases/gallery/054.jpeg",
      "/cases/gallery/055.jpeg",
      "/cases/gallery/056.jpeg",
      "/cases/gallery/057.jpeg",
      "/cases/gallery/058.jpeg"
    ]
  },
  {
    "id": 6,
    "title": "Modern house for stay in Kampala, Uganda with 1000 sqm area",
    "image": "/cases/6.jpeg",
    "location": "Uganda",
    "project_type": "",
    "text01": "Located in the heart of Kampala, Uganda, this 1000 sqm space is a blank canvas waiting to be transformed into a modern masterpiece. The interior design style chosen for this project is modern, which will bring a sleek and sophisticated look to the space. To bring this vision to life, we will be delivering a range of high-quality products including wooden flooring, marble countertops, top-of-the-line sanitary features, stylish lighting fixtures, sleek cabinetry, modern windows and doors, and a stunning staircase design. Each of these elements will come together to create a cohesive and contemporary look that will elevate the space to new heights.",
    "text02": "The wooden flooring selected for this project will add warmth and texture to the space, while the marble countertops will bring a touch of luxury and elegance. The sanitary features will be both functional and stylish, adding a sleek and modern touch to the bathrooms and kitchen. The lighting fixtures chosen will not only illuminate the space but also serve as statement pieces, adding style and sophistication.",
    "text03": "The cabinetry will be sleek and minimalistic, providing ample storage space while maintaining a clean and modern look. The windows and doors will be carefully selected to enhance the natural light and flow of the space, while the staircase design will be a focal point, adding a touch of drama and style.",
    "text04": "Overall, this project will transform the 1000 sqm space in Kampala into a modern oasis, where sophistication meets functionality. With our carefully curated selection of products and attention to detail, we are confident that this space will exceed all expectations and become a truly stunning example of modern interior design.",
    "gallery": [
      "/cases/gallery/059.jpeg",
      "/cases/gallery/060.jpeg",
      "/cases/gallery/061.jpeg",
      "/cases/gallery/062.jpeg",
      "/cases/gallery/063.jpeg",
      "/cases/gallery/064.jpeg",
      "/cases/gallery/065.jpeg",
      "/cases/gallery/066.jpeg",
      "/cases/gallery/067.jpeg",
      "/cases/gallery/068.jpeg",
      "/cases/gallery/069.jpeg",
      "/cases/gallery/070.jpeg",
      "/cases/gallery/071.jpeg",
      "/cases/gallery/072.jpeg",
      "/cases/gallery/073.jpeg",
      "/cases/gallery/074.jpeg",
      "/cases/gallery/075.jpeg"
    ]
  },
  {
    "id": 7,
    "title": "Contemporary Design for Tanzania Project: 889 sqm",
    "image": "/cases/7.jpeg",
    "location": "Kenya",
    "project_type": "",
    "text01": "Our project in Tanzania involves the construction of a private villa in Magenagna, featuring a basement, ground floor, and two additional levels with a total area of 1299 square meters. As a supplier for this project, we are responsible for providing a variety of items to complete the construction process.One of our primary supply items for this project is tiles, which will be used for flooring and wall coverings throughout the villa. We will also be supplying sanitary fixtures for the bathrooms and kitchens, including sinks, toilets, and showers. In addition, we will provide doors for the interior and exterior of the villa, as well as aluminum windows for natural lighting and ventilation.",
    "text02": "Stairs will be supplied for easy access to the different levels of the villa, while kitchen cabinets and wardrobes will be provided for storage and organization. Lighting fixtures will also be supplied to illuminate the villa both indoors and outdoors. Lastly, wall panels will be supplied to add a decorative touch to the interior design of the villa.",
    "text03": "We are committed to providing high-quality and durable products for this project to ensure the villa is functional, comfortable, and aesthetically pleasing. Our team of professionals will work closely with the construction team to ensure a smooth and successful supply process. We are excited to be a part of this project and look forward to seeing the completed private villa in Magenagna, Tanzania.",
    "text04": "",
    "gallery": [
      "/cases/gallery/059.jpeg",
      "/cases/gallery/076.jpeg",
      "/cases/gallery/077.jpeg",
      "/cases/gallery/078.jpeg",
      "/cases/gallery/079.jpeg",
      "/cases/gallery/080.jpeg",
      "/cases/gallery/081.jpeg",
      "/cases/gallery/082.jpeg",
      "/cases/gallery/083.jpeg",
      "/cases/gallery/084.jpeg",
      "/cases/gallery/085.jpeg",
      "/cases/gallery/086.jpeg",
      "/cases/gallery/087.jpeg",
      "/cases/gallery/088.jpeg",
      "/cases/gallery/089.jpeg",
      "/cases/gallery/090.jpeg",
      "/cases/gallery/091.jpeg",
      "/cases/gallery/092.jpeg",
      "/cases/gallery/093.jpeg",
      "/cases/gallery/094.jpeg"
    ]
  },
  {
    "id": 8,
    "title": "Modern decor style project in Moscow, Russia: 1800 sqm space",
    "image": "/cases/8.jpeg",
    "location": "Moscow, Russia",
    "project_type": "",
    "text01": "Supply items: Tiles ,sanitary,Door, Aluminum window, stairs, kitchen cabinet, wardrobes,lightings,wall panels .",
    "text02": "Completion date :2024",
    "text03": "In 2023, the customer invited our team for measurement and installation. With the cooperation of the owner and our professional guidance, our team of 5 people spent 15 days to complete the installation of the stairs, Windows and walls of the main building.  From the initial drawing confirmation to the final installation, the entire process took 4 months. This includes four weeks of design, 15 days of production and 3 days of shipping. Moscow, Russia is the location of our latest project - a private villa spanning 1800 square meters. This luxurious villa is set to be completed by 2024 and will feature a wide range of high-quality supplies to ensure a beautiful and functional living space. For this project, we will be supplying a variety of items including tiles, sanitary ware, doors, aluminum windows, stairs, kitchen cabinets, wardrobes, lightings, and wall panels. Each item has been carefully selected to meet the highest standards of design and durability, ensuring that the villa will be both aesthetically pleasing and practical for its residents.",
    "text04": "The design of the villa will reflect the unique beauty of Moscow, incorporating elements of traditional Russian architecture with modern touches. The spacious layout and high-quality finishes will create a comfortable and inviting atmosphere for the homeowners to enjoy. We are excited to see this project come to life and to contribute to the creation of a stunning private villa in Moscow. Stay tuned for updates on the progress of this project as we work towards its completion in 2024.",
    "gallery": [
      "/cases/gallery/059.jpeg",
      "/cases/gallery/096.jpeg",
      "/cases/gallery/097.jpeg",
      "/cases/gallery/098.jpeg",
      "/cases/gallery/099.jpeg",
      "/cases/gallery/100.jpeg",
      "/cases/gallery/101.jpeg",
      "/cases/gallery/102.jpeg",
      "/cases/gallery/103.jpeg",
      "/cases/gallery/104.jpeg",
      "/cases/gallery/105.jpeg",
      "/cases/gallery/106.jpeg",
      "/cases/gallery/107.jpeg",
      "/cases/gallery/108.jpeg",
      "/cases/gallery/109.jpeg",
      "/cases/gallery/110.jpeg",
      "/cases/gallery/111.jpeg",
      "/cases/gallery/112.jpeg",
      "/cases/gallery/113.jpeg",
      "/cases/gallery/114.jpeg",
      "/cases/gallery/115.jpeg",
      "/cases/gallery/116.jpeg"
    ]
  },
  {
    "id": 10,
    "title": "Kenya Nairobi Runda：Explore the Beauty of Nairobi Runda",
    "image": "/cases/9.jpeg",
    "location": "Kenya Nairobi Runda",
    "project_type": "",
    "text01": "Private villa in Kenya Nairobi Runda",
    "text02": "Supply items: Door, window, stairs, wall cloth,Completion date :2019",
    "text03": "In 2019, the customer invited our team to Nairobi, Kenya for measurement and installation.With the cooperation of the owner and our professional guidance, our team of7 peoplespent 20 days to complete the installation of the stairs, Windows and walls of the mainbuilding and the hotel. From the initial drawing confirmation to the final installation, theentire process took three months. This includes two weeks of design, 40 days of productionand 35 days of shipping.",
    "text04": "",
    "gallery": [
      "/cases/gallery/117.jpeg",
      "/cases/gallery/118.jpeg",
      "/cases/gallery/119.jpeg",
      "/cases/gallery/120.jpeg",
      "/cases/gallery/121.jpeg",
      "/cases/gallery/122.jpeg",
      "/cases/gallery/123.jpeg",
      "/cases/gallery/124.jpeg",
      "/cases/gallery/125.jpeg",
      "/cases/gallery/126.jpeg"
    ]
  },
  {
    "id": 11,
    "title": "Building a Future in South Sudan's Capital City",
    "image": "/cases/10.jpeg",
    "location": "South Sudan",
    "project_type": "Private villa in Juba city",
    "text01": "Supply item: Tiles,wardrobe, kitchen cabinets, lightings, windows,doors, gates, furniture,AC,lift,fences.",
    "text02": "Finish date: 2025",
    "text03": "In 2022, our company sent engineering personally to Juba city take measurements onsite before production. Currently, this project is under construction.",
    "text04": "",
    "gallery": [
      "/cases/gallery/127.jpeg",
      "/cases/gallery/128.jpeg",
      "/cases/gallery/129.jpeg",
      "/cases/gallery/130.jpeg",
      "/cases/gallery/131.jpeg",
      "/cases/gallery/132.jpeg",
      "/cases/gallery/133.jpeg",
      "/cases/gallery/134.jpeg",
      "/cases/gallery/135.jpeg",
      "/cases/gallery/136.jpeg",
      "/cases/gallery/137.jpeg",
      "/cases/gallery/138.jpeg",
      "/cases/gallery/139.jpeg",
      "/cases/gallery/140.jpeg",
      "/cases/gallery/141.jpeg",
      "/cases/gallery/142.jpeg",
      "/cases/gallery/143.jpeg",
      "/cases/gallery/144.jpeg"
    ]
  },
  {
    "id": 12,
    "title": "Kenya Nairobi Luxury Hotel: Five-Star Accommodation in a Prime Location",
    "image": "/cases/11.jpeg",
    "location": "Singapore",
    "project_type": "",
    "text01": "Nairobi, Kenya to discuss the construction of a new hotel with 500 rooms in the heart of the city. The project was set to be a luxurious destination for both business and leisure travelers, with state-of-the-art amenities and stunning views of the city skyline.",
    "text02": "Our team was tasked with sourcing the necessary supplies for the construction of the hotel, including doors, windows, staircase, wall-cloth, and lighting fixtures. We worked closely with local suppliers to ensure that the materials met our client's specifications and were delivered on time to meet the construction schedule. After months of planning and coordination, the grand opening date for the hotel was set for January 2024. The hotel was expected to be a landmark in Nairobi, offering unparalleled hospitality and luxury to its guests.",
    "text03": "As we look back on our experience working on this project, we are proud of the role we played in bringing this vision to life. The hotel will not only provide a new destination for travelers to Nairobi but also create jobs and opportunities for the local community.",
    "text04": "We are excited to see the hotel come to fruition and look forward to its grand opening in 2024. Our team is grateful for the opportunity to be a part of this project and we are confident that it will be a success for our client and for the city of Nairobi.",
    "gallery": ["/cases/11.jpeg"]
  },
  {
    "id": 13,
    "title": "The Best of Singapore's Restaurant Design and Furniture",
    "image": "/cases/12.jpeg",
    "location": "Singapore",
    "project_type": "",
    "text01": "Project type: Club",
    "text02": "Supply item: doors, timber screens, cushions, chairs, glass tables, decorative entrance, carpets, decorative wooden skirtings, reception tables, wall-cloths.  ",
    "text03": "Finished date: 2021",
    "text04": "In 2021, there was a custom product order from a club in Singapore. Due to the COVID-19 pandemic, our company only supplied the products but did not send construction personnel. Since all the procurement items were custom-made, our design team and the client's design team engaged in a month-long communication process to finalize the quantities, dimensions, and design plans for all the procurement items. It took 40 days to complete the customization of all the products, and they were successfully shipped.",
    "gallery": [
      "/cases/gallery/145.jpeg",
      "/cases/gallery/146.jpeg",
      "/cases/gallery/147.jpeg",
      "/cases/gallery/148.jpeg",
      "/cases/gallery/149.jpeg",
      "/cases/gallery/150.jpeg",
      "/cases/gallery/151.jpeg",
      "/cases/gallery/152.jpeg",
      "/cases/gallery/153.jpeg",
      "/cases/gallery/154.jpeg",
      "/cases/gallery/155.jpeg",
      "/cases/gallery/156.jpeg",
      "/cases/gallery/157.jpeg",
      "/cases/gallery/158.jpeg",
      "/cases/gallery/159.jpeg",
      "/cases/gallery/160.jpeg",
      "/cases/gallery/161.jpeg",
      "/cases/gallery/162.jpeg",
      "/cases/gallery/163.jpeg",
      "/cases/gallery/164.jpeg",
      "/cases/gallery/165.jpeg",
      "/cases/gallery/166.jpeg",
      "/cases/gallery/167.jpeg"
    ]
  }
]
